In [12]:
import pandas as pd
import numpy as np

In [20]:
df =  pd.read_csv('StudentsPerformance.csv')

In [22]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [24]:
df.shape

(1000, 8)

In [26]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [28]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [30]:
df.columns = ['gender','race_eth','parental_edu_level',
              'lunch','test_prep_course','math_scr','reading_scr',
              'writing_scr']
df.head()

,gender,race_eth,parental_edu_level,lunch,test_prep_course,math_scr,reading_scr,writing_scr
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [34]:
df['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [40]:
518+482

1000

In [38]:
df['race_eth'].value_counts()

race_eth
group C    319
group D    262
group B    190
group E    140
group A     89
Name: count, dtype: int64

In [42]:
df['parental_edu_level'].value_counts()

parental_edu_level
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

In [44]:
df['lunch'].value_counts()

lunch
standard        645
free/reduced    355
Name: count, dtype: int64

In [46]:
df['test_prep_course'].value_counts()

test_prep_course
none         642
completed    358
Name: count, dtype: int64

# Filtering

## 1) Using dataframe

#### Q1) Filter all the students who belongs to group D race_eth

In [52]:
df['race_eth'].value_counts()

race_eth
group C    319
group D    262
group B    190
group E    140
group A     89
Name: count, dtype: int64

In [56]:
r1 = df[df['race_eth']=='group D']
print(r1.shape)
r1.head()

(262, 8)

,gender,race_eth,parental_edu_level,lunch,test_prep_course,math_scr,reading_scr,writing_scr
8,male,group D,high school,free/reduced,completed,64,64,67
11,male,group D,associate's degree,standard,none,40,52,43
20,male,group D,high school,standard,none,66,69,63
22,male,group D,some college,standard,none,44,54,53
24,male,group D,bachelor's degree,free/reduced,completed,74,71,80

#### Q2) Filter all the students belongs to group B race_eth and their test_preparation course is completed

In [60]:
# df['race_eth'].value_counts()
df['test_prep_course'].value_counts()
# group B - 190
# completed - 358
# print(190+358)

test_prep_course
none         642
completed    358
Name: count, dtype: int64

In [72]:
r2a = df[(df['race_eth']=='group D') & (df['test_prep_course']=='completed')]
print(r2a.shape)
r2a.head()

(82, 8)

,gender,race_eth,parental_edu_level,lunch,test_prep_course,math_scr,reading_scr,writing_scr
8,male,group D,high school,free/reduced,completed,64,64,67
24,male,group D,bachelor's degree,free/reduced,completed,74,71,80
38,female,group D,associate's degree,free/reduced,completed,75,90,88
48,female,group D,associate's degree,free/reduced,completed,57,74,76
58,male,group D,some college,standard,completed,58,59,58

In [76]:
r2a = df[['gender','parental_edu_level','lunch','math_scr','reading_scr','writing_scr']][(df['race_eth'] =='group B') & (df['test_prep_course']=='completed')]
print(r2a.shape)
r2a.head()

(68, 6)

,gender,parental_edu_level,lunch,math_scr,reading_scr,writing_scr
6,female,some college,standard,88,95,92
21,female,some college,free/reduced,65,75,70
43,male,some college,free/reduced,59,65,66
96,male,some high school,standard,65,66,62
103,male,high school,standard,60,44,47

####  Q3) Filter all the female students whose math score is greater than average math score obtained by all the students.

In [83]:
avg_math_scr = df['math_scr'].mean()
avg_math_scr

66.089

In [87]:
r3 =  df[(df['gender']=='female') & (df['math_scr']>avg_math_scr)]
print(r3.shape)
r3.head()

(221, 8)

,gender,race_eth,parental_edu_level,lunch,test_prep_course,math_scr,reading_scr,writing_scr
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

#### Q4) Filter all the students whose parental_edu_level is master's degree or the students are male.

In [89]:
r4 = df[(df['parental_edu_level']=="master's degree") | (df['gender']=='male')]
print(r4.shape)
r4.sample(5)

(518, 8)

,gender,race_eth,parental_edu_level,lunch,test_prep_course,math_scr,reading_scr,writing_scr
836,male,group E,high school,standard,none,73,64,57
196,male,group C,some high school,free/reduced,completed,59,69,65
379,male,group A,bachelor's degree,standard,none,66,64,62
292,male,group C,some high school,standard,completed,63,60,57
876,male,group D,some college,standard,none,81,82,84

# 2) Using query function

#### Q5) Find all the students whose reading score is less than average reading score and whose lunch is 'standard'

In [94]:
avg_read_scr = df['reading_scr'].mean()
avg_read_scr

69.169

In [96]:
df.columns

Index(['gender', 'race_eth', 'parental_edu_level', 'lunch', 'test_prep_course',
       'math_scr', 'reading_scr', 'writing_scr'],
      dtype='object')

In [103]:
df['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [107]:
qry1 = df.query("gender=='female'")
qry1.shape

(518, 8)

In [109]:
qry2 = df.query('gender=="female"')
qry2.shape

(518, 8)

In [98]:
r5 = df.query(f"reading_scr<{avg_read_scr} and lunch == 'standard' ")
r5.shape

(269, 8)

In [111]:
r5 = df.query(f"reading_scr<{avg_read_scr} and lunch == 'standard' ")
r5.shape
#r5[['reading_scr','lunch']]
r5.head()

,gender,race_eth,parental_edu_level,lunch,test_prep_course,math_scr,reading_scr,writing_scr
10,male,group C,associate's degree,standard,none,58,54,52
11,male,group D,associate's degree,standard,none,40,52,43
14,female,group A,master's degree,standard,none,50,53,58
20,male,group D,high school,standard,none,66,69,63
22,male,group D,some college,standard,none,44,54,53

## Q6) Filter all the students whose race_eth is not group C and whose gender is female.

In [101]:
r6 = df.query("race_eth!='group C' and gender== 'female'")
print(r6.shape)
r6.head()

(338, 8)

,gender,race_eth,parental_edu_level,lunch,test_prep_course,math_scr,reading_scr,writing_scr
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
9,female,group B,high school,free/reduced,none,38,60,50

# 3) Using df.loc function

#### Q7) Filter all the male students whose math score is greater than average math score obtained by all the students and whose reading score is less than average reading score obtained by all the students.

In [123]:
print(df['math_scr'].mean())
print(df['reading_scr'].mean())

66.089
69.169

In [119]:
r7 = df.loc[(df['math_scr']>df['math_scr'].mean()) & (df['reading_scr']<df['reading_scr'].mean())]
print(r7.shape)
r7.head()

(92, 8)

,gender,race_eth,parental_edu_level,lunch,test_prep_course,math_scr,reading_scr,writing_scr
26,male,group B,some college,standard,none,69,54,55
27,female,group C,bachelor's degree,standard,none,67,69,75
51,male,group E,associate's degree,free/reduced,completed,77,69,68
65,male,group B,some high school,standard,none,67,64,61
83,male,group E,associate's degree,standard,none,72,64,63

# Sort

#### Q8) Sort the dataframe in increasing order of math score

In [130]:
r8 = df.sort_values(by='math_scr')
r8.head()

,gender,race_eth,parental_edu_level,lunch,test_prep_course,math_scr,reading_scr,writing_scr
59,female,group C,some high school,free/reduced,none,0,17,10
980,female,group B,high school,free/reduced,none,8,24,23
17,female,group B,some high school,free/reduced,none,18,32,28
787,female,group B,some college,standard,none,19,38,32
145,female,group C,some college,free/reduced,none,22,39,33

#### Q9) Sort the dataframe in decreasing order of reading score

In [128]:
r9 = df.sort_values(by='reading_scr',ascending=False)
r9.head()

,gender,race_eth,parental_edu_level,lunch,test_prep_course,math_scr,reading_scr,writing_scr
546,female,group A,some high school,standard,completed,92,100,97
970,female,group D,bachelor's degree,standard,none,89,100,100
149,male,group E,associate's degree,free/reduced,completed,100,100,93
566,female,group E,bachelor's degree,free/reduced,completed,92,100,100
712,female,group D,some college,standard,none,98,100,99

In [132]:
df_f1 = df[df['reading_scr']==100]
df_f1.shape

(17, 8)

In [134]:
r_sort = df.sort_values(by=['math_scr','reading_scr'])
print(r_sort.shape)
r_sort.head(20)

(1000, 8)

,gender,race_eth,parental_edu_level,lunch,test_prep_course,math_scr,reading_scr,writing_scr
59,female,group C,some high school,free/reduced,none,0,17,10
980,female,group B,high school,free/reduced,none,8,24,23
17,female,group B,some high school,free/reduced,none,18,32,28
787,female,group B,some college,standard,none,19,38,32
145,female,group C,some college,free/reduced,none,22,39,33
842,female,group B,high school,free/reduced,completed,23,44,36
338,female,group B,some high school,free/reduced,none,24,38,27
466,female,group D,associate's degree,free/reduced,none,26,31,38
91,male,group C,high school,free/reduced,none,27,34,36
363,female,group D,some high school,free/reduced,none,27,34,32
327,male,group A,some college,free/reduced,none,28,23,19
601,female,group C,high school,standard,none,29,29,30
683,female,group C,some high school,free/reduced,completed,29,40,44
528,female,group D,bachelor's degree,free/reduced,none,29,41,47
596,male,group B,high school,free/reduced,none,30,24,15
76,male,group E,some high school,standard,none,30,26,22
895,female,group E,some high school,free/reduced,none,32,34,38
555,female,group C,some college,free/reduced,none,32,39,33
785,female,group B,some high school,standard,completed,32,51,44
55,female,group C,high school,free/reduced,none,33,41,43

# Group By

#### Q10) Find sum of math score based on Race ethinicity.

In [140]:
df['race_eth'].value_counts()

race_eth
group C    319
group D    262
group B    190
group E    140
group A     89
Name: count, dtype: int64

In [138]:
r10 = df.groupby('race_eth')['math_scr'].sum()
print(type(r10))
r10

<class 'pandas.core.series.Series'>

race_eth
group A     5485
group B    12056
group C    20564
group D    17649
group E    10335
Name: math_scr, dtype: int64

#### Q11) Find sum of math score and reading score based on parental level of education.

In [143]:
r11 = df.groupby('parental_edu_level')[['math_scr','reading_scr']].sum()
print(type(r11))
r11

<class 'pandas.core.frame.DataFrame'>

                    math_scr  reading_scr
parental_edu_level
associate's degree     15070        15746
bachelor's degree       8188         8614
high school            12179        12682
master's degree         4115         4447
some college           15171        15698
some high school       11366        11982

#### Q12) Find sum of writing score and reading score based on gender and race ethnicity.

In [146]:
r12 = df.groupby(['gender','race_eth'])[['writing_scr','reading_scr']].sum()
print(type(r12))
r12

<class 'pandas.core.frame.DataFrame'>

                 writing_scr  reading_scr
gender race_eth
female group A          2443         2484
       group B          7285         7392
       group C         12920        12950
       group D          9678         9552
       group E          5212         5233
male   group A          3135         3272
       group B          5179         5405
       group C          8717         9094
       group D          8700         8796
       group E          4785         4991

In [148]:
r13 = df.groupby(['gender','race_eth'])[['math_scr']].sum()
print(type(r13))
r13

<class 'pandas.core.frame.DataFrame'>

                 math_scr
gender race_eth
female group A       2107
       group B       6386
       group C      11166
       group D       8417
       group E       4886
male   group A       3378
       group B       5670
       group C       9398
       group D       9232
       group E       5449

In [150]:
r13 = df.groupby(['gender','race_eth'])['math_scr'].sum()
print(type(r13))
r13

<class 'pandas.core.series.Series'>

gender  race_eth
female  group A      2107
        group B      6386
        group C     11166
        group D      8417
        group E      4886
male    group A      3378
        group B      5670
        group C      9398
        group D      9232
        group E      5449
Name: math_scr, dtype: int64